function[]=Search(i,j,A)

k=zeros(2,500);
k(1,1)=i;%当前的节点(k(1,1),k(2,1))
k(2,1)=j;%当前的节点(k(1,1),k(2,1))
n=1;

A(i,j)=0;
i=0,j=0;%这个设置是让循环开始，所以注意最左上角的像素不能是非零的，否则会出问题

while i~=k(1,1) | j~=k(2,1)
    
   i=k(1,n),j=k(2,n);%这个是为了在第一次进入循环的时候ij的取值正常
   if i==1 
       if j==1
           %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 
           if A(i,j+1)~=0
           A(i,j+1)=0;
           j=j+1;
           n=n+1;
           
               else if A(i+1,j)~=0
                   A(i+1,j)=0;
                   i=i+1;
                   n=n+1;
                 
           else
           n=n-1;
           i=k(1,n),j=k(2,n);
                   end
           end
           %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 
       else
           %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 
           if A(i,j+1)~=0
           A(i,j+1)=0;
           j=j+1;
           n=n+1;
           
       else if A(i+1,j)~=0
               A(i+1,j)=0;
               i=i+1;
               n=n+1;
               
           else if A(i,j-1)~=0
                   A(i,j-1)=0;
                   j=j-1;
                   n=n+1;
               else
                   n=n-1;
                   i=k(1,n),j=k(2,n);
                   
               end
                   
               end
           end
           %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 

       end
   else 
       if j==1
           %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 
            if A(i-1,j)~=0
       A(i-1,j)=0;
       i=i-1;
       n=n+1;
       
   else if A(i,j+1)~=0
           A(i,j+1)=0;
           j=j+1;
           n=n+1;
           
       else if A(i+1,j)~=0
               A(i+1,j)=0;
               i=i+1;
               n=n+1;
               
               else
                   n=n-1;
                   i=k(1,n),j=k(2,n);
           end
       end
            end
           
           %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 
           
       else
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%       
 if A(i-1,j)~=0
       A(i-1,j)=0;
       i=i-1;
       n=n+1;
       
   else if A(i,j+1)~=0
           A(i,j+1)=0;
           j=j+1;
           n=n+1;
           
       else if A(i+1,j)~=0
               A(i+1,j)=0;
               i=i+1;
               n=n+1;
               
           else if A(i,j-1)~=0
                   A(i,j-1)=0;
                   j=j-1;
                   n=n+1;
               else
                   n=n-1;
                   i=k(1,n),j=k(2,n);
                   
               end
                   
               end
           end
   end
   %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
       end
   end
       
  
       k(1,n)=i,k(2,n)=j;
   
end

%%%%%%%%while到这里结束%%%%%%%%%%%%%%%%%%
   
   A(k(1,1),k(2,1))=1;
       
    
end